//
//  Singleton.swift
//  DominoPizzaExercise
//
//  Created by 이태형 on 2022/09/09.
//

import Foundation
import UIKit

class singleton{
    static let share: singleton = singleton()
    private init(){}
    
    let superseed = ["글램핑 바비큐", "알로하 하와이안", "우리 고구마", "콰트로 치즈 퐁듀"]
    let premium = ["더블크러스트 이베리코", "블랙앵거스 스테이크", "블랙타이거 슈림프", "와규 앤 비스테카", "직화 스테이크"]
    let classic = ["베이컨체더치즈", "불고기", "슈퍼디럭스", "슈퍼슈프림", "페퍼로니", "포테이토"]
    let sidedish = ["딸기 슈크림", "슈퍼곡물 치킨", "애플 크러스트 디저트", "치킨퐁듀 그라탕", "퀴노아 치킨 샐러드", "포테이토 순살치킨"]
    let beverage = ["미닛메이드 스파클링 청포도", "스프라이트", "코카콜라 제로", "코카콜라"]
    let pickleSauce = ["갈릭 디핑 소스", "스위트 칠리소스", "우리 피클 L", "우리 피클 M", "핫소스"]
    
    var productNum = ["글램핑 바비큐": 0, //10000
                         "알로하 하와이안": 0,
                         "우리 고구마": 0,
                         "콰트로 치즈 퐁듀": 0,
                         "더블크러스트 이베리코": 0,
                         "블랙앵거스 스테이크": 0,
                         "블랙타이거 슈림프": 0,
                         "와규 앤 비스테카": 0,
                         "직화 스테이크": 0,
                         "베이컨체더치즈": 0,
                         "불고기": 0,
                         "슈퍼디럭스": 0,
                         "슈퍼슈프림": 0,
                         "페퍼로니": 0,
                         "포테이토": 0,
                         "딸기 슈크림": 0,  //7000
                         "슈퍼곡물 치킨": 0,
                         "애플 크러스트 디저트": 0,
                         "치킨퐁듀 그라탕": 0,
                         "퀴노아 치킨 샐러드": 0,
                         "포테이토 순살치킨": 0,
                         "미닛메이드 스파클링 청포도": 0,  //3000
                         "스프라이트": 0,
                         "코카콜라 제로": 0,
                         "코카콜라": 0,
                         "갈릭 디핑 소스": 0,  //500
                         "스위트 칠리소스": 0,
                         "우리 피클 L": 0,
                         "우리 피클 M": 0,
                         "핫소스": 0]
    
    var cart = [Product]()
}
